WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
// struct freqDcData_s
// {
//   // In the following 'Lead' is the leading edge, which can be rising
//   // or falling). It is the edge that begins the measurement cycle and
//   // 'Trail' is the opposite edge.
//   // The Lead to Lead count is the time for one full cycle, allowing
//   // us to calculate the frequency. The Lead to Trail is the first half
//   // of the cycle allowing us to calculate the duty cycle.
//   volatile uint8_t activeState;           // Interrupt error of some type
//   volatile uint32_t countLeadToLead;      // Count leading edge to next one
//   volatile uint32_t countLeadToTrail;     // Count leading edge to 1/2 cycle
//   volatile uint32_t LeadToLeadOverFlow;   // Leading to Leading overflow count
//   volatile uint32_t LeadToTrailOverFlow;  // Leading to Trailing overflow count
//   uint32_t inputConfig;                   // Nuttx style GPIO configuration
//   uint8_t inputPolarity;       // 0=leading is rising, 1=leading is falling
// };

#define MEADOW_FREQ_DC_TOTAL_TIMERS_AVAILABLE (sizeof(freqTimerInfoArray)/sizeof(struct freqDcTimerInfo_s))

//----------------------------------------------------------------------------
// GPIOs definitions are in their own table due to the GPIO being based on
// the F7 type.
struct timerGpio_s
{
  // In Nuttx pin is bits 3:0, port bits 7:4 (one byte) and Alt Func 15:12
  uint8_t timerF7v1Gpio[4];  // GPIO for each timer channel
  uint8_t timerF7v2Gpio[4];  // GPIO for each timer channel
  uint16_t timerAltFunc;     // GPIO Alternate Function for each timer
};

// This array defines the GPIO values that must be used by the various timers.
// There can be up to 4 channels per timer. Notice that this array contains
// F7v1 and F7v2 values as well as the alternate function for each timer. It
// should be obvious but, this table must line up with the previous
// freqTimerInfoArray table.
// The '*' below indicates that this GPIO is used by more than 1 timer.
static struct timerGpio_s timerGpioArray[] =
{
  //                            F7v1                                              F7v2                       Alt Func
  /* TIM2  GPIO NOT EXPOSED     */ {{0xff,0xff,0xff,0xff}, /* GPIO NOT EXPOSED     */ {0xff,0xff,0xff,0xff}, GPIO_AF1},
  /* TIM3  D02, D05, D06, D09   */ {{0x26,0x27,0x10,0x11}, /* D05, D10, A03, A04   */ {0x14,0x27,0x10,0x11}, GPIO_AF2},
  /* TIM4  D08, D07, D03*, D04* */ {{0x16,0x17,0x18,0x19}, /* D08, D07, D03*, D04* */ {0x16,0x17,0x18,0x19}, GPIO_AF2},
  /* TIM5  D10,                 */ {{0x7a,0xff,0xff,0xff}, /* D02,            A02  */ {0x7a,0xff,0xff,0x03}, GPIO_AF2},
  /* TIM9  A02,                 */ {{0x03,0xff,0xff,0xff}, /* A02                  */ {0x03,0xff,0xff,0xff}, GPIO_AF3},
  /* TIM10 D03*,                */ {{0x18,0xff,0xff,0xff}, /* D03*                 */ {0x18,0xff,0xff,0xff}, GPIO_AF3},
  /* TIM11 D04*,                */ {{0x19,0xff,0xff,0xff}, /* D04*                 */ {0x19,0xff,0xff,0xff}, GPIO_AF3},
  /* TIM12 D12, D13             */ {{0x1e,0x1e,0xff,0xff}, /* D12, D13             */ {0x1e,0x1f,0xff,0xff}, GPIO_AF9},
  /* TIM13 GPIO NOT EXPOSED     */ {{0xff,0xff,0xff,0xff}, /* GPIO NOT EXPOSED     */ {0xff,0xff,0xff,0xff}, GPIO_AF3},
  /* TIM14 A03,                 */ {{0x07,0xff,0xff,0xff}, /* GPIO NOT EXPOSED     */ {0xff,0xff,0xff,0xff}, GPIO_AF9},
};

/************************************************************************************
 * Private Function Prototypes
 ************************************************************************************/

static int meadow_calc_freq_dc_init(struct freqDcTimerInfo_s *freqDcTimerInfo);

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/
// This ISR is called for all frequency with duty cycle interrupts.
// On the first rising edge of the input, the timer clears the CNT count and
// CNT begins counting up.
// On the following falling edge, the timer copies the CNT value into CCR2.
// On the next rising edge, the timer copies the CNT value into CCR1 and CNT
// is again cleared to zero and the process repeats.
// This means that we must save the CCR1 and CCR2 timer values between the
// rising edge and the falling edge.
// For 16-bit timers, this is more complex because we must maintain a count
// for each CNT overflow interrupt. This allows us to maintain a 32-bit value.
// For CCR1 overflow for the entire period but for CCR2 only between the
// rising edge and the falling edge.
// Note: a 16-bit register at 96 MHz will overflow every 683 microseconds.
static int meadow_calc_freq_dc_freq_dutycycle_isr(int irq, void *context, void *arg)
{
  if(! configCompleted)
    return OK;

  struct freqDcTimerInfo_s *freqDcTimerInfo = (struct freqDcTimerInfo_s *)arg;
  struct freqDcData_s *freqDcData = (struct freqDcData_s *)freqDcTimerInfo->freqDcData;

  uint32_t timerBase = freqDcTimerInfo->timerBase;
  uint16_t timStatusReg = getreg16(timerBase + STM32_GTIM_SR_OFFSET);

  syslog(1, "%s@%d-D06 LED on Entered ISR\n", __FILE__, __LINE__);

  stm32_gpiowrite(DEBUG_PIN_V2_D06, true);

  // The Problem with 16-bit timers.
  // At certain input frequencies the CNT being cleared and the CNT overflow
  // are reported in the same interrupt. However, there is only 1 bit available
  // to indicate both conditions.
  // The highest frequency this occurs at is TimerClock/65536, which is
  // 1,464.844 Hz with a timer clock of 96 MHz. This reoccurs at the intervals
  // (TimerClock/65536)/2, (TimerClock/65536)/3 etc.
  // More details.
  // For most input frequencies, on a leading (e.g. rising) or trailing (e.g.
  // falling) edge an interrupt is generated containing the CC1IF (leading) or
  // CC2IF (trailing) flags set. The UIF flag is always set with the CC1IF
  // flag, to indicate that the CNT register has been cleared. However, at
  // some frequencies, the overflow and the CNT reset occur at the same moment.
  // The UIF is set but it cannot be determined if it indicates CNT overflow or
  // CNT reset.
  switch(timStatusReg & 0x0007)
  {
    case 0x00:    // Nothing happened, just ignore
      break;

    //------------------------------------------------------------
    case 0x01:    // Lone UIF flag. CNT register changed, either reset or overflow)
      timStatusReg &= ~GTIM_SR_UIF;

      // Add to Leading to leading overflow
      freqDcData->LeadToLeadOverFlow++;
      break;

    //------------------------------------------------------------
    // Leading Edge
    case 0x02:    // Lone leading edge, never expected
      timStatusReg &= ~GTIM_SR_CC1IF;
      freqDcData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    case 0x03:     // Leading edge + UIF (Normal for End/Start of capture)
      timStatusReg &= ~GTIM_SR_UIF;   // Could be overflow or CNT reset
      timStatusReg &= ~GTIM_SR_CC1IF; // Leading edge should be CNT reset

      if(freqDcTimerInfo->timerWidth == MEADOW_FREQ_DC_WIDTH_32)
      {
        // At this point we expect to have seen a trailing edge and no errors
        if(freqDcData->activeState == MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING)
        {
          // Save values
          freqDcData->countLeadToLead = getreg32(timerBase + STM32_GTIM_CCR1_OFFSET);
          freqDcData->countLeadToTrail = getreg32(timerBase + STM32_GTIM_CCR2_OFFSET);
        }
        else
        {
          freqDcData->countLeadToLead = 0;
          freqDcData->countLeadToTrail = 0;
        }

        freqDcData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING;
        break;
      }

      // Must be 16-bit timer
      uint32_t count1;
      uint32_t count2;

      if(freqDcData->activeState == MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING)
      {
        // Save values
        count1 = getreg16(timerBase + STM32_GTIM_CCR1_OFFSET);
        count2 = getreg16(timerBase + STM32_GTIM_CCR2_OFFSET);

