WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
        // Add each 16-bit CNT overflow to counts
        count1 += (freqDcData->LeadToLeadOverFlow * MEADOW_FREQ_DC_16_BIT_OVERFLOW_COUNT);
        count2 += (freqDcData->LeadToTrailOverFlow * MEADOW_FREQ_DC_16_BIT_OVERFLOW_COUNT);

        // Check for various detectable errors. There are some that cannot
        // be detected.
        // Since there's a limit to the highest frequency we can detect then
        // count1 has a minimum value it can be.
        if(count1 < MEADOW_FREQ_DC_MINIMUM_USABLE_CNT)
        {
          count1 = 0;
          count2 = 0;
        }
        else if(count1 < count2)
        {
          // This "fix" works in some cases, one is the initial frequency
          // that causes trouble (i.e. TimerClock/65536). It may be that
          // multiple overflow interrupts are being missed.
          count1 += MEADOW_FREQ_DC_16_BIT_OVERFLOW_COUNT;
        }
        else
        {
          // Reasonable Duty Cycle test, must be > 1.0% and < 99.0%
          uint32_t dutyCycle = (count2 * 1000)/count1;
          if(dutyCycle < 10 || dutyCycle > 990)
          {
            count1 = 0;
            count2 = 0;
          }
        }
      }
      else
      {
        count1 = 0;
        count2 = 0;
      }

      // Provide consumer with values
      freqDcData->countLeadToLead = count1;
      freqDcData->countLeadToTrail = count2;
      
      // Clear previous overflow
      freqDcData->LeadToLeadOverFlow = 0;
      freqDcData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING;
      break;

    // Trailing/Falling Edge
    case 0x05:    // Falling edge with UIF (i.e. assume Falling Edge + Overflow)
      timStatusReg &= ~GTIM_SR_UIF;

    case 0x04:    // Falling edge alone. End of CCR2 capture.
      timStatusReg &= ~GTIM_SR_CC2IF;

      // Falling edge check if there has been a valid leading edge
      if(freqDcData->activeState != MEADOW_FREQ_DC_FREQ_DC_SYNC_LEADING)
      {
        freqDcData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
        break;  // And quit
      }
      
      // Falling edge means we're done with CCR2's value. We don't need
      // to worry about CNT overflow with respect to CCR2 either.
      if(timStatusReg & GTIM_SR_UIF)
        freqDcData->LeadToLeadOverFlow++;    // Adjust overflow count

      // Time to capture the first half overflow
      freqDcData->LeadToTrailOverFlow = freqDcData->LeadToLeadOverFlow;
    
      // This value will be tested when the leading edge arrives
      freqDcData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_TRAILING;
      break;

    //------------------------------------------------------------
    case 0x06:    // (illegal) Rising and Falling together, no way
      timStatusReg &= ~GTIM_SR_CC1IF;
      timStatusReg &= ~GTIM_SR_CC2IF;
      freqDcData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    case 0x07:    // (illegal) Rising and Falling plus UIF
      // This case exists when the duty cycle is very small (< 0.5%) or very
      // large (> 99.5%)
      timStatusReg &= ~GTIM_SR_CC1IF;
      timStatusReg &= ~GTIM_SR_CC2IF;
      timStatusReg &= ~GTIM_SR_UIF;
      freqDcData->activeState = MEADOW_FREQ_DC_FREQ_DC_SYNC_ERROR;
      break;

    // There are only 3 bits to check, so this is a not needed. We've checked
    // all possible combinations
    default:
      break;
  }
  syslog(1, "%s@%d-D06 LED off Exiting ISR\n", __FILE__, __LINE__);
  stm32_gpiowrite(DEBUG_PIN_V2_D06, false);

  // Clear status register as needed
  putreg16(timStatusReg, timerBase + STM32_GTIM_SR_OFFSET);
  return OK;
}

//=============================================================
static uint32_t meadow_calc_freq_dc_get_apb_clock(
          const struct freqDcTimerInfo_s *freqDcTimerInfo)
{
  if(freqDcTimerInfo->timerAPBClk)
    return STM32_RCC_APB2ENR;
  else
    return STM32_RCC_APB1ENR;
}

//=============================================================
// Uses the bit-field to determine the Timer clock
static uint32_t meadow_calc_freq_dc_get_max_clock(
          const struct freqDcTimerInfo_s *freqDcTimerInfo)
{
  if(freqDcTimerInfo->timerMaxClk)
    return STM32_APB2_TIM1_CLKIN;
  else
    return STM32_APB1_TIM2_CLKIN;
}

//=============================================================
static void meadow_calc_freq_dc_disable(const uint32_t timerBase)
{
  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
static void meadow_calc_freq_dc_enable(const uint32_t timerBase)
{
  // Why this order? tried to copy the NUTTX order

  // Enable timer Counter
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  
  // Re-initialize the counter and generates an update of the registers
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

//=====================================================================
// The following function finds the specified timer's built-in information.
// It should never return NULL;
struct freqDcTimerInfo_s *meadow_calc_freq_dc_get_timer_info_pointer(const int timerNumb)
{
  for (int offset = 0; offset < MEADOW_FREQ_DC_TOTAL_TIMERS_AVAILABLE; offset++)
  {
    // Find the offset for the timer number
    if(freqTimerInfoArray[offset].timerNumb == timerNumb)
    {
      // Found the offset return the array
      return ( &(freqTimerInfoArray[offset]));
    }
  }

  return NULL;
}

//=====================================================================
// From the timer number find the correct GPIO table entry
static struct timerGpio_s *meadow_calc_freq_dc_get_timer_gpio_pointer(const int timerNumb)
{
  // Look through all the times and find the matching one 
  for (int offset = 0; offset < MEADOW_FREQ_DC_TOTAL_TIMERS_AVAILABLE; offset++)
  {
    if(freqTimerInfoArray[offset].timerNumb == timerNumb)
    {
      // Found the offset return a pointer from different array
      return ( &(timerGpioArray[offset]));
    }
  }

