WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
  return NULL;
}

//=====================================================================
// This function looks up the correct alternate function of the
// input point for the timer. This is limited to inputs that can be used
static uint32_t meadow_calc_freq_dc_get_af_for_input(const int timerNumb)
{
  // Get the pointer to the GPIO information specified by the timerNumb.
  struct timerGpio_s *timerGpio =
            meadow_calc_freq_dc_get_timer_gpio_pointer(timerNumb);
  
  // The alternate function is Meadow version and input independent
  return timerGpio->timerAltFunc;
}

//=============================================================
// Find the proper timer, version and channel for the GPIO Alt
// Function, Port and Pin for this timer.
// Returns either 1-4 or MEADOW_FREQ_DC_BAD_GPIO_VALUE.
static uint32_t meadow_calc_freq_dc_get_ver_based_gpio_chan(const int timerNumb,
          uint8_t portAndPin)
{
  uint32_t chan;

  // Get the pointer to the master structure that contains all the GPIO
  // information.
  struct timerGpio_s *timerGpio =
            meadow_calc_freq_dc_get_timer_gpio_pointer(timerNumb);

  // Depending on the version find specified GPIO
  if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V1)
  {
    for(chan = 0; chan < MEADOW_FREQ_DC_MAX_TIMER_CHANNELS; chan++)
    {
      if(timerGpio->timerF7v1Gpio[chan] == portAndPin)
        return chan + 1;
    }
    return MEADOW_FREQ_DC_BAD_GPIO_VALUE;    // Not found
  }
  else if(meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_F7V2 ||
          meadow_hw_version_get() == MEADOW_F7_HW_VERSION_NUMB_CCMV2)
  {
    for(chan = 0; chan < MEADOW_FREQ_DC_MAX_TIMER_CHANNELS; chan++)
    {
      if(timerGpio->timerF7v2Gpio[chan] == portAndPin)
        return chan + 1;
    }
    return MEADOW_FREQ_DC_BAD_GPIO_VALUE;    // Not found
  }
  else
  {
    return MEADOW_FREQ_DC_BAD_GPIO_VALUE;   // Invalid version
  }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called by Meadow.Core to configure
// Timer numbers range from 1 - 14. However, some are not defined because they
// aren't available to Meadow.
int meadow_calc_freq_dc_freq_duty_config(const int timerNumber,
          const uint8_t portAndPin, const uint8_t gpioPolarity)
{
  int ret;
  uint32_t inputGpioConfig;
  static bool firstTime = true;

  if(firstTime)
  {
    // (--) Diag LED
    syslog(1, "%s@%d-LED at D06 configured\n", __FILE__, __LINE__);
    stm32_configgpio(DEBUG_PIN_V2_D06);
    // (--) Diag LED
  }

  // (--) Diag LED
  syslog(1, "%s@%d-D06 LED on-Entered config\n", __FILE__, __LINE__);
  stm32_gpiowrite(DEBUG_PIN_V2_D06, true);
  sleep(1);
  // (--) Diag LED

  // Check if there's already an object in this slot. The
  struct freqDcTimerInfo_s *freqDcTimerInfo =
            meadow_calc_freq_dc_get_timer_info_pointer(timerNumber);
  if(freqDcTimerInfo->freqDcData != NULL)
  {
    syslog(LOG_ERR, "%s@%d-Already timer defined in slot.\n", __FILE__, __LINE__);
    return -ERROR;
  }

  // Allocate a new struct for each new timer
  freqDcTimerInfo->freqDcData = zalloc(sizeof(struct freqDcData_s));
  if(freqDcTimerInfo->freqDcData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Memory allocation returned NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }
  
  freqDcTimerInfo->freqDcData->inputPolarity = gpioPolarity;

  // Get the timer dependent alternate function
  uint32_t altFunction = meadow_calc_freq_dc_get_af_for_input(timerNumber);
  if(altFunction == MEADOW_FREQ_DC_BAD_GPIO_VALUE)
  {
    syslog(LOG_ERR, "%s@%d-Timer%d has no alternate function defined\n", __FILE__, __LINE__);
    free(freqDcTimerInfo->freqDcData);
    return -ENOTSUP;   // Not supported
  }

  // Timers have, at most, 1-4 channels each representing 1 GPIOs. For
  // the specified timer we need to verify a proper port and pin.
  // The channelFound value isn't used here, it only indicates success.
  uint32_t channelFound =
            meadow_calc_freq_dc_get_ver_based_gpio_chan(timerNumber,
            portAndPin);
  if(channelFound == MEADOW_FREQ_DC_BAD_GPIO_VALUE)
  {
    syslog(2, "The requested GPIO and Timer combination are not supported\n");
    free(freqDcTimerInfo->freqDcData);
    return -ENOTSUP;
  }
  
  // This is enough to configure a GPIO
  inputGpioConfig = portAndPin | altFunction;

  // Diagnostic
  syslog(1, "%s@%d-input Pin defn:0x%02x (P%c%d), Pin defn + AF:0x%08lx\n",
            __FILE__, __LINE__, portAndPin,
            ((portAndPin) >> 4) + 'A', portAndPin & 0x0f, inputGpioConfig);
  // Diagnostic

  freqDcTimerInfo->freqDcData->inputConfig = inputGpioConfig;

  // Valid GPIO so configure input point for timer.
  ret = stm32_configgpio(freqDcTimerInfo->freqDcData->inputConfig);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Error:stm32_configgpio() returned:%ld\n",
              __FILE__, __LINE__, ret);
    free(freqDcTimerInfo->freqDcData);
    return -ENOTSUP;   // Not supported
  }
    
  // Initialized the timer hardware
  ret = meadow_calc_freq_dc_init(freqDcTimerInfo);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow freq + duty cycle init failed:%d\n", __FILE__, __LINE__, ret);
    free(freqDcTimerInfo->freqDcData);
    return ret;
  }

  if(firstTime)
  {
    firstTime = false;

    // Allow ISR to execute
    configCompleted = true;
  }

  // (--) Diag LED
  sleep(1);
  syslog(1, "%s@%d-D06 LED off - Exited configuration\n", __FILE__, __LINE__);
  stm32_gpiowrite(DEBUG_PIN_V2_D06, false);
  return OK;
}

//=============================================================
// Frequency and duty cycle measurement.
int meadow_calc_freq_dc_init(struct freqDcTimerInfo_s *freqDcTimerInfo)
{
  // See RM0410 Reference manual for STM32F76xxx and STM32F77xxx section 26.3.6
  // for original concept.

  // A single input (T1) is used. It is configured as input to Compare/Capture
  // registers 1 and 2. For CCR1 it is configured to for leading edge interrupt
  // and trailing edge for ccr2. By using the count between interrupts for one
  // CCR's (i.e. leading to leading edges) the frequency can be found by
  // counting between interrupts from leading to trailing the duty cycle can be
  // found.

