WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/specialized/meadow_calc_freq_dc.c
//=============================================================
// Called to unconfigure timer
// Timer numbers range from 1 - 14. However, some are not defined because they
// aren't available to Meadow.
int meadow_calc_freq_dc_freq_duty_unconfig(const uint32_t timerNumber)
{
  // Is this timer doing frequency measurements?
  struct freqDcTimerInfo_s *freqDcTimerInfo =
            meadow_calc_freq_dc_get_timer_info_pointer(timerNumber);

  // Is this slot being used?
  if(freqDcTimerInfo->freqDcData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Can't unconfigure, no timer %lu.\n",
              __FILE__, __LINE__, timerNumber);
    return -EBADSLT;    // Invalid slot
  }

  // Stop interrupts
  up_disable_irq(freqDcTimerInfo->timerIrqVec);

  // Stop timer
  meadow_calc_freq_dc_disable(freqDcTimerInfo->timerBase);

  // Unconfigure GPIO
  stm32_unconfiggpio(freqDcTimerInfo->freqDcData->inputConfig);

  free(freqDcTimerInfo->freqDcData);
  freqDcTimerInfo->freqDcData = NULL;
  return OK;
}

//================================================================
// Return Frequency and Duty Cycle infomation to mono
int meadow_calc_freq_dc_mono_freq_duty_cycle(struct freqDcReturnData_s *returnData)
{
  // These insure that once a valid value is found, a change in the timer's
  // data structure won't affect the output.
  uint32_t completeCycle;
  uint32_t firstHalfCycle;
  uint32_t validCheckCount = 0;

  // Use timer number to find the information to return
  struct freqDcTimerInfo_s *freqDcTimerInfo = 
            meadow_calc_freq_dc_get_timer_info_pointer(returnData->timerNumber);
  if(freqDcTimerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Timer not configured\n", __FILE__, __LINE__);
    return -ENXIO;      // Unconfigured timer for this feature
  }

  // Is there an object here?
  if(freqDcTimerInfo->freqDcData == NULL)
  {
    syslog(LOG_ERR, "%s@%d-No timer assigned\n", __FILE__, __LINE__);
    return -ENODATA;      // No timer initialized
  }

  // Find valid data. This is only an issue at higher frequencies.
  for(validCheckCount = 0;\
      validCheckCount < MEADOW_FREQ_DC_READ_GOOD_DATA_ATTEMPTS;
      validCheckCount++)
  {
    completeCycle  = freqDcTimerInfo->freqDcData->countLeadToLead;
    firstHalfCycle = freqDcTimerInfo->freqDcData->countLeadToTrail;

    if(completeCycle > 0 && firstHalfCycle > 0)
      break;      // Found valid data, exit

    usleep(1 * 1000);   // delay 1-2 ms waiting for valid data
  }

  if(completeCycle > 0 && firstHalfCycle > 0)
  {
    // Do floating point math for calculations to get better resolution.
    double dutyCycle = (double)(firstHalfCycle * 100.0) / (double)completeCycle;
    double freq = (double)(MEADOW_FREQ_DC_CLOCK_FREQ)/ \
              (double)completeCycle;

    returnData->freqX1000       = (uint32_t)(freq * 1000.0);
    returnData->dutyCycleX1000  = (uint32_t)(dutyCycle * 1000.0);
  }
  else
  {
    // Return 0s as no data available
    returnData->freqX1000       = 0;
    returnData->dutyCycleX1000  = 0;
  }

  // Prevent this count from being reused if there's no input.
  freqDcTimerInfo->freqDcData->countLeadToLead   = 0;
  freqDcTimerInfo->freqDcData->countLeadToTrail  = 0;

  return OK;
}

#endif    // #if defined(MEADOW_INCLUDE_CALC_FREQ_DC_IN_BUILD)
